#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	// Команда на форме профиля анализирует данные формы, в том числе не записанные; в остальных случаях - профиль
	// из базы.
	Оповещение = Новый Структура("Профиль, Обработано", ПараметрКоманды, Ложь);
	Оповестить(mcp1c_АдминистрированиеКлиент.СобытиеАнализРисковПрофиля(), Оповещение,
		ПараметрыВыполненияКоманды.Источник);
	Если Не Оповещение.Обработано Тогда
		mcp1c_АдминистрированиеКлиент.ПоказатьАнализРисков(ПараметрКоманды);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
