
#Область ОбработчикиСобытий

Функция КореньPOST(Запрос)
	Возврат mcp1c_Протокол.ОбработатьHTTPЗапрос(Запрос);
КонецФункции

Функция КореньGET(Запрос)
	Возврат mcp1c_Протокол.ОбработатьHTTPЗапрос(Запрос);
КонецФункции

Функция КореньDELETE(Запрос)
	Возврат mcp1c_Протокол.ОбработатьHTTPЗапрос(Запрос);
КонецФункции

Функция КореньPUT(Запрос)
	Возврат mcp1c_Протокол.ОбработатьHTTPЗапрос(Запрос);
КонецФункции

Функция КореньPATCH(Запрос)
	Возврат mcp1c_Протокол.ОбработатьHTTPЗапрос(Запрос);
КонецФункции

Функция КореньOPTIONS(Запрос)
	Возврат mcp1c_Протокол.ОбработатьHTTPЗапрос(Запрос);
КонецФункции

#КонецОбласти
